src/cfe/Кодерлайн_интеграция_Розница/InformationRegisters/ксп_МэппингПричинаОтменыЗаказаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_МэппингПричинаОтменыЗаказаКлиента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Кодерлайн_интеграция_Розница/InformationRegisters/ксп_МэппингПричинаОтменыЗаказаКлиента/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПоМэппингу(GUID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ПричинаОтмены КАК ПричинаОтмены
		|ИЗ
		|	РегистрСведений.ксп_МэппингПричинаОтменыЗаказаКлиента КАК Рег
		|ГДЕ
		|	Рег.GUID = &GUID";
	
	Если GUID = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	//это может быть тэг узла ссылки (identification)
	Если ТипЗнч(GUID)  = Тип("Структура") Тогда
		ГУИД = "";
		GUID.Свойство("Ref", ГУИД);
		GUID = ГУИД;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(GUID) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос.УстановитьПараметр("GUID", GUID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ПричинаОтмены;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
